.CODE

;====================================================================================================================
;模仿D3D11-DrwaIndexed()函数，跳转至原始函数被覆盖代码的粘贴位置(参数5)，导出时按照原始函数多一个额外参数的形式定义
;参数1		rcx-立即上下文对象的指针
;参数2		rdx 
;参数3		r8 
;参数4		r9 
;参数5		[rsp+20h]-被覆盖代码的粘贴位置
;本函数调用前，第5个参数放在[rsp+20h]处，执行CALL后，因为rsp减去8h，所以在本函数中第5个参数位于[rsp+20h+8h]=[rsp+28h]处
;=====================================================================================================================
ASM_Fake_DrwaIndexed PROC
	MOV rax,[rsp+28h]		;获取第5个参数
	PUSH rax				;利用寄存器向栈中压入8字节的数据，从而实现远跳转
	RET						;以ret跳转至原始函数	
ASM_Fake_DrwaIndexed ENDP

END